       IDENTIFICATION DIVISION.                                                 
       PROGRAM-ID. INTRDATE.                                                    
       DATA DIVISION.                                                           
       WORKING-STORAGE  SECTION.                                                
       01 DATE-VARS.                                                            
           05 CURRENT-YEAR      PIC X(4).                                       
           05 CURRENT-MON       PIC X(2).                                       
           05 CURRENT-DAY       PIC X(2).                                       
           05 CURRENT-HOUR      PIC X(2).                                       
           05 CURRENT-MIN       PIC X(2).                                       
           05 CURRENT-SEC       PIC X(2).                                       
           05 CURRENT-MSEC      PIC X(2).                                       
           05 LOCAL-TIME.                                                       
             10 TIME-DIF     PIC X(1).                                          
             10 TIME-DIF-H   PIC X(2).                                          
             10 TIME-DIF-M   PIC X(2).                                          
       01 CURRENT-WEEK-DAY   PIC 9(1).                                          
       01 WEEKDAYS-TABLE.                                                       
           05                PIC X(9) VALUE "Monday".                           
           05                PIC X(9) VALUE "Tuesday".                          
           05                PIC X(9) VALUE "Wednesday".                        
           05                PIC X(9) VALUE "Thursday".                         
           05                PIC X(9) VALUE "Friday".                           
           05                PIC X(9) VALUE "Saturday".                         
           05                PIC X(9) VALUE "Sunday".                           
       01               REDEFINES WEEKDAYS-TABLE.                               
           05 DT-OF-WK            OCCURS 7 TIMES PIC X(9).                      
       PROCEDURE DIVISION.                                                      
           MOVE FUNCTION CURRENT-DATE TO DATE-VARS.                             
           ACCEPT CURRENT-WEEK-DAY FROM DAY-OF-WEEK.                            
           DISPLAY "Date: Year " CURRENT-YEAR  " Month " CURRENT-MON            
               " Day " CURRENT-DAY "(" DT-OF-WK(CURRENT-WEEK-DAY) ")".          
           DISPLAY "Time: Hour " CURRENT-HOUR  " Minute " CURRENT-MIN           
               " Second " CURRENT-SEC "." CURRENT-MSEC.                         
           IF LOCAL-TIME NOT = 0 THEN                                           
           DISPLAY "Time difference with Greenwich mean time for this"          
      -            "zone: "                                                     
                   TIME-DIF TIME-DIF-H " Hours " TIME-DIF-M " Minutes"          
           END-IF.                                                              
           GOBACK.                                                              
